[net]
batch=32
subdivisions=8
height=416
width=416
# max_crop=512
channels=3
momentum=0.9
decay=0.0005

learning_rate=0.001
#burn_in=1000
#max_batches=6000
max_batches=100000
#policy=poly 
#power=5
policy=steps
#steps=3000
steps=50000,80000
#scales=.01
scales=.1,.1

hue=.1
saturation=.75
exposure=.75

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-9

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[reorg]
stride=2

[route]
layers=-1,-4

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
# num_of_anchor_box * (num_of_class + num_of_coords+ 1)
filters=138
size=1
stride=1
pad=1
activation=linear

[region]
#anchors = 0.22,0.12,  0.37,0.26,  0.5,0.8,  0.83,1.36,  1.21,2.24,  2.09,3.87
#anchors = 0.25,0.18,  0.36,0.46,  0.52,0.79,  0.77,1.26,  1.10,2.33,  1.90,4.00
anchors = 0.27,0.22,  0.41,0.73,  0.89,1.30,  0.93,0.36,  1.48,2.95,  4.58,7.13
bias_match=1
classes=18
coords=4
num=6
softmax=1
jitter=.2		
rescore=1

object_scale=5
noobject_scale=.5
class_scale=1
coord_scale=1.2

absolute=1
thresh = .6
random=1
